function c=shengsu(t,s,z)
%根据海水中的温度盐度静压力求声速
%t温度（°C） 
%s盐度（%） 
%z深度（m ）
%p-静压力（bar ）
%c声速
format long
p=1.033+1.028126e-1*z+2.38e-7*z.^2-6.8e-17*z.^4;
if ((t>=3&&t<=30)&&(p>=1.013&&p<=980)) %判断输入参数是否在适用范围    
    dCt=4.6233*t-(5.4585e-2)*t.^2+(2.822e-4)*t.^3+(5.07e-7)*t.^4;    
    dCp=(1.60518e-1)*p+(1.0279e-5)*p.^2+(3.451e-9)*p.^3-(3.503e-12)*p.^4; dCs=1.391*(s-35)-7.8e-2*(s-35).^2;    
    dCstp=1.35e-5*t.^2.*p-7.19e-7.*t.*p.^2-1.2e-2*(s-35).*t;    
    c=1449.22+dCt+dCp+dCs+dCstp;   
else error('请输入正确的参数范围！');    
end



