function [ T ] = zm_MSS2d( g,dw,xmin,xmax,v,t,e )
%函数名：zm_MSS2d:用于生成二维的海面模型
%---------------------------------------------------
%参数说明：
%g,重力加速度
%dw,频率采样间隔
%xmin,xmax,距离选取的最小最大值（间隔固定为1）
%v,风速
%t,时间
%e,随机初始相位，为矩阵，大小为（1，length（w））
%生成矩阵T，第一列为距离，第二列为浪高
%---------------------------------------------------
%函数利用PM谱对海面进行二维模拟，模型采用L_H模型
%制作人:Miaozhy
%制作时间:2019.10.29
%版本号:1.0.0
w=[2*pi/100:dw:2*pi];
x=[xmin:xmax];
k=w.^2/g;
Sw=(((8.1*10^(-3)*g.^2))./(w.^5)).*exp(-0.74.*(g./(v.*w)).^4);
T=zeros(2,length(x));
e=rand(1,length(w))*2*pi;
for i=1:length(w)
    for j=1:length(x)
        T(2,j)=T(2,j)+(Sw(i)*2*2*pi/100)^0.5*cos(k(i)*x(j)-w(i)*t+e(i));
    end
end
T(1,:)=x;
T=T';
end

